Repository: prathameshpatil1001/temp
Catalog: temp/Localizable.xcstrings
Source language: en
Languages: hi, kn, mr, ta, te

source: Tenure (Months)
hi: अवधि (महीने)
kn: ಅವಧಿ (ತಿಂಗಳುಗಳು)
mr: कालावधी (महिने)
ta: காலம் (மாதங்கள்)
te: కాలపరిమితి (నెలలు)

source: Tenure Remaining
hi: शेष अवधि
kn: ಉಳಿದಿರುವ ಅವಧಿ
mr: उर्वरित कालावधी
ta: மீதமுள்ள காலம்
te: మిగిలిన కాలపరిమితి

source: Text Size
hi: टेक्स्ट का आकार
kn: ಅಕ್ಷರ ಗಾತ್ರ
mr: मजकूर आकार
ta: உரை அளவு
te: టెక్స్ట్ పరిమాణం

source: The key factors influencing your 724 score.
hi: आपके 724 स्कोर को प्रभावित करने वाले मुख्य कारक।
kn: ನಿಮ್ಮ 724 ಅಂಕವನ್ನು ಪ್ರಭಾವಿಸುವ ಪ್ರಮುಖ ಅಂಶಗಳು.
mr: तुमच्या 724 स्कोअरवर प्रभाव करणारे महत्त्वाचे घटक.
ta: உங்கள் 724 மதிப்பெண்ணை பாதிக்கும் முக்கிய காரணிகள்.
te: మీ 724 స్కోర్‌ను ప్రభావితం చేసే ముఖ్య అంశాలు.

source: The statement has been saved to your device.
hi: स्टेटमेंट आपके डिवाइस में सहेज दिया गया है।
kn: ಸ್ಟೇಟ್ಮೆಂಟ್ ನಿಮ್ಮ ಸಾಧನದಲ್ಲಿ ಉಳಿಸಲಾಗಿದೆ.
mr: स्टेटमेंट तुमच्या डिव्हाइसवर सेव्ह झाले आहे.
ta: அறிக்கை உங்கள் சாதனத்தில் சேமிக்கப்பட்டது.
te: స్టేట్‌మెంట్ మీ పరికరంలో సేవ్ చేయబడింది.

source: This helps us understand eligibility before we ask for verification documents.
hi: इससे हमें सत्यापन दस्तावेज़ मांगने से पहले आपकी पात्रता समझने में मदद मिलती है।
mr: यामुळे आम्हाला पडताळणी दस्तऐवज मागण्यापूर्वी पात्रता समजण्यास मदत होते.
ta: சரிபார்ப்பு ஆவணங்களை கேட்கும் முன் தகுதியை புரிந்துகொள்ள இது உதவுகிறது.
te: ధృవీకరణ పత్రాలు అడిగే ముందు అర్హతను అర్థం చేసుకోవడానికి ఇది మాకు సహాయపడుతుంది.

source: This Loan
hi: यह लोन
mr: हे कर्ज
ta: இந்த கடன்
te: ఈ రుణం

source: This uses Apple’s native passkey sheet and keeps the private key on the device. Face ID or Touch ID unlocks it when the server-side WebAuthn flow is ready.
hi: यह Apple की मूल passkey शीट का उपयोग करता है और निजी कुंजी को डिवाइस पर रखता है। सर्वर-साइड WebAuthn प्रवाह तैयार होने पर Face ID या Touch ID इसे अनलॉक करता है।
mr: हे Apple च्या मूळ passkey sheetचा वापर करते आणि खाजगी की डिव्हाइसवरच ठेवते. server-side WebAuthn flow तयार झाल्यावर Face ID किंवा Touch ID ते अनलॉक करते.
ta: இது Apple இன் சொந்த passkey sheet ஐ பயன்படுத்தி, தனிப்பட்ட விசையை சாதனத்திலேயே வைத்திருக்கும். server-side WebAuthn ஓட்டம் தயாரானபோது Face ID அல்லது Touch ID அதைப் திறக்கும்.
te: ఇది Apple యొక్క స్థానిక passkey sheet ను ఉపయోగించి, వ్యక్తిగత కీని పరికరంలోనే ఉంచుతుంది. server-side WebAuthn ప్రవాహం సిద్ధమైనప్పుడు Face ID లేదా Touch ID దాన్ని అన్‌లాక్ చేస్తుంది.

source: This usually takes a few seconds. Please don't close the app.
hi: इसमें आमतौर पर कुछ सेकंड लगते हैं। कृपया ऐप बंद न करें।
kn: ಇದು ಸಾಮಾನ್ಯವಾಗಿ ಕೆಲವು ಸೆಕೆಂಡುಗಳು ತೆಗೆದುಕೊಳ್ಳುತ್ತದೆ. ದಯವಿಟ್ಟು ಆಪ್ ಮುಚ್ಚಬೇಡಿ.
mr: यास साधारणपणे काही सेकंद लागतात. कृपया अॅप बंद करू नका.
ta: இது பொதுவாக சில விநாடிகள் எடுக்கும். தயவுசெய்து பயன்பாட்டை மூட வேண்டாம்.
te: ఇది సాధారణంగా కొన్ని సెకన్లు పడుతుంది. దయచేసి యాప్‌ను మూసేయవద్దు.

source: This usually takes a few seconds. Please don’t close the app.
hi: इसमें आमतौर पर कुछ सेकंड लगते हैं। कृपया ऐप बंद न करें।
kn: ಇದು ಸಾಮಾನ್ಯವಾಗಿ ಕೆಲವು ಸೆಕೆಂಡುಗಳು ತೆಗೆದುಕೊಳ್ಳುತ್ತದೆ. ದಯವಿಟ್ಟು ಆಪ್ ಮುಚ್ಚಬೇಡಿ.
mr: यास साधारणपणे काही सेकंद लागतात. कृपया अॅप बंद करू नका.
ta: இது பொதுவாக சில விநாடிகள் எடுக்கும். தயவுசெய்து பயன்பாட்டை மூட வேண்டாம்.
te: ఇది సాధారణంగా కొన్ని సెకన్లు పడుతుంది. దయచేసి యాప్‌ను మూసేయవద్దు.

source: This will disable authenticator-based quick login on this device.
hi: यह इस डिवाइस पर ऑथेंटिकेटर-आधारित त्वरित लॉगिन को अक्षम कर देगा।
kn: ಇದು ಈ ಸಾಧನದಲ್ಲಿ ಆಥೆಂಟಿಕೇಟರ್ ಆಧಾರಿತ ತ್ವರಿತ ಲಾಗಿನ್ ಅನ್ನು ನಿಷ್ಕ್ರಿಯಗೊಳಿಸುತ್ತದೆ.
mr: यामुळे या डिव्हाइसवरील ऑथेंटिकेटर-आधारित जलद लॉगिन बंद होईल.
ta: இது இந்த சாதனத்தில் அங்கீகரிப்பு செயலி அடிப்படையிலான விரைவு உள்நுழைவை முடக்கும்.
te: ఇది ఈ పరికరంలో ఆథెంటికేటర్ ఆధారిత త్వరిత లాగిన్‌ను నిలిపివేస్తుంది.

source: Total
hi: कुल
kn: ಒಟ್ಟು
mr: एकूण
ta: மொத்தம்
te: మొత్తం

source: Total Amount
hi: कुल राशि
kn: ಒಟ್ಟು ಮೊತ್ತ
mr: एकूण रक्कम
ta: மொத்த தொகை
te: మొత్తం

source: Total Amount Payable
hi: कुल देय राशि
kn: ಪಾವತಿಸಬೇಕಾದ ಒಟ್ಟು ಮೊತ್ತ
mr: एकूण देय रक्कम
ta: மொத்தமாக செலுத்த வேண்டிய தொகை
te: మొత్తం చెల్లించాల్సిన మొత్తం

source: Total Due As of Today
hi: आज की कुल देय राशि
kn: ಇಂದಿನ ದಿನಾಂಕದ ಒಟ್ಟು ಬಾಕಿ
mr: आजपर्यंत एकूण देय
ta: இன்றைய நிலவரப்படி மொத்த நிலுவை
te: ఈ రోజు వరకు మొత్తం బకాయి

source: Total EMI
hi: कुल EMI
kn: ಒಟ್ಟು EMI
mr: एकूण EMI
ta: மொத்த EMI
te: మొత్తం EMI

source: Total Interest
hi: कुल ब्याज
kn: ಒಟ್ಟು ಬಡ್ಡಿ
mr: एकूण व्याज
ta: மொத்த வட்டி
te: మొత్తం వడ్డీ

source: Total Interest (10.5% p.a.)
hi: कुल ब्याज (10.5% प्रतिवर्ष)
mr: एकूण व्याज (10.5% वार्षिक)
ta: மொத்த வட்டி (10.5% ஆண்டு)
te: మొత్తం వడ్డీ (10.5% వార్షిక)

source: Total Interest Saved
hi: कुल ब्याज बचाया गया
kn: ಉಳಿಸಿದ ಒಟ್ಟು ಬಡ್ಡಿ

source: Total Loan
hi: कुल ऋण
kn: ಒಟ್ಟು ಸಾಲ
mr: एकूण कर्ज
ta: மொத்த கடன்
te: మొత్తం రుణం

source: Total Overdue
hi: कुल बकाया
kn: ಒಟ್ಟು ಮೀರಿದ ಬಾಕಿ
mr: एकूण थकबाकी
ta: மொத்த நிலுவை
te: మొత్తం బకాయి

source: Total Saved
hi: कुल सहेजा गया
kn: ಒಟ್ಟು ಉಳಿವು

source: Track
hi: ट्रैक
kn: ಟ್ರ್ಯಾಕ್
mr: ट्रॅक
ta: கண்காணி
te: ట్రాక్

source: Track and manage all your loan requests.
hi: अपने सभी ऋण अनुरोधों को ट्रैक और प्रबंधित करें।
kn: ನಿಮ್ಮ ಎಲ್ಲಾ ಸಾಲ ವಿನಂತಿಗಳನ್ನು ಟ್ರ್ಯಾಕ್ ಮಾಡಿ ಮತ್ತು ನಿರ್ವಹಿಸಿ.
mr: तुमच्या सर्व कर्ज विनंत्या ट्रॅक आणि व्यवस्थापित करा.
ta: உங்கள் அனைத்து கடன் கோரிக்கைகளையும் கண்காணித்து நிர்வகிக்கவும்.
te: మీ అన్ని రుణ అభ్యర్థనలను ట్రాక్ చేసి నిర్వహించండి.

source: Track Application Status
hi: आवेदन की स्थिति ट्रैक करें
kn: ಅರ್ಜಿಯ ಸ್ಥಿತಿಯನ್ನು ಟ್ರ್ಯಾಕ್ ಮಾಡಿ
mr: अर्ज स्थिती ट्रॅक करा
ta: விண்ணப்ப நிலையை கண்காணிக்கவும்
te: దరఖాస్తు స్థితిని ట్రాక్ చేయండి

source: Track Status
hi: स्थिति ट्रैक करें
kn: ಸ್ಥಿತಿಯನ್ನು ಟ್ರ್ಯಾಕ್ ಮಾಡಿ
mr: स्थिती ट्रॅक करा
ta: நிலையை கண்காணி
te: స్థితిని ట్రాక్ చేయండి

source: Transaction ID
hi: लेनदेन आईडी
mr: व्यवहार आयडी
ta: பரிவர்த்தனை ஐடி
te: లావాదేవీ ID

source: Transactions
hi: लेनदेन
kn: ವ್ಯವಹಾರಗಳು
mr: व्यवहार
ta: பரிவர்த்தனைகள்
te: లావాదేవీలు

source: Try another method
hi: दूसरा तरीका आज़माएं
kn: ಇನ್ನೊಂದು ವಿಧಾನ ಪ್ರಯತ್ನಿಸಿ
mr: दुसरी पद्धत वापरून पहा
ta: மற்றொரு முறையை முயற்சிக்கவும்
te: మరొక విధానాన్ని ప్రయత్నించండి

source: Turn Off
hi: बंद करें
kn: ಆಫ್ ಮಾಡಿ
mr: बंद करा
ta: அணைக்கவும்
te: ఆఫ్ చేయండి

source: Turn Off Authenticator App?
hi: Authenticator ऐप बंद करें?
kn: ಆಥೆಂಟಿಕೇಟರ್ ಆಪ್ ಅನ್ನು ಆಫ್ ಮಾಡಬೇಕೆ?
mr: Authenticator अॅप बंद करायचे?
ta: Authenticator செயலியை அணைக்கவா?
te: Authenticator యాప్‌ను ఆపాలా?

source: Unfortunately, your current credit score does not meet the minimum requirements for this specific loan product. We recommend improving your credit score and reapplying after 90 days.
hi: दुर्भाग्यवश, आपका वर्तमान क्रेडिट स्कोर इस विशेष ऋण उत्पाद की न्यूनतम आवश्यकताओं को पूरा नहीं करता। हम सलाह देते हैं कि आप अपना क्रेडिट स्कोर सुधारें और 90 दिनों बाद फिर से आवेदन करें।
mr: दुर्दैवाने, तुमचा सध्याचा क्रेडिट स्कोअर या विशिष्ट कर्ज उत्पादनासाठी आवश्यक किमान निकष पूर्ण करत नाही. आम्ही सुचवतो की तुम्ही तुमचा क्रेडिट स्कोअर सुधारून 90 दिवसांनी पुन्हा अर्ज करा.
ta: துரதிருஷ்டவசமாக, உங்கள் தற்போதைய கடன் மதிப்பெண் இந்த குறிப்பிட்ட கடன் தயாரிப்பின் குறைந்தபட்ச தேவைகளை பூர்த்தி செய்யவில்லை. உங்கள் கடன் மதிப்பெண்ணை மேம்படுத்தி 90 நாட்களுக்கு பிறகு மீண்டும் விண்ணப்பிக்க பரிந்துரைக்கிறோம்.
te: దురదృష్టవశాత్తు, మీ ప్రస్తుత క్రెడిట్ స్కోర్ ఈ ప్రత్యేక రుణ ఉత్పత్తికి అవసరమైన కనిష్ట ప్రమాణాలను చేరుకోలేదు. మీ క్రెడిట్ స్కోర్‌ను మెరుగుపరచి 90 రోజుల తర్వాత మళ్లీ దరఖాస్తు చేయాలని మేము సూచిస్తున్నాము.

source: Unlocked Benefits
hi: अनलॉक किए गए लाभ
kn: ಅನ್ಲಾಕ್ ಆಗಿದ ಪ್ರಯೋಜನಗಳು

source: Unsuccessful
hi: असफल
kn: ಯಶಸ್ವಿಯಾಗಿಲ್ಲ
mr: अयशस्वी
ta: தோல்வி
te: విజయవంతం కాలేదు

source: Up to
hi: तक
kn: ವರೆಗೆ
mr: पर्यंत
ta: வரை
te: వరకు

source: Upcoming
hi: आगामी
kn: ಮುಂದಿನ
mr: आगामी
ta: வரவிருக்கும்
te: రాబోయే

source: Upcoming Schedule
hi: आगामी शेड्यूल
kn: ಮುಂದಿನ ವೇಳಾಪಟ್ಟಿ
mr: आगामी वेळापत्रक
ta: வரவிருக்கும் அட்டவணை
te: రాబోయే షెడ్యూల్

source: Updated today
hi: आज अपडेट किया गया
kn: ಇಂದು ನವೀಕರಿಸಲಾಗಿದೆ
mr: आज अद्यतनित
ta: இன்று புதுப்பிக்கப்பட்டது
te: ఈరోజు నవీకరించబడింది

source: Upload Documents
hi: दस्तावेज़ अपलोड करें
kn: ದಾಖಲೆಗಳನ್ನು ಅಪ್‌ಲೋಡ್ ಮಾಡಿ
mr: दस्तऐवज अपलोड करा
ta: ஆவணங்களை பதிவேற்று
te: పత్రాలను అప్‌లోడ్ చేయండి

source: Use Authenticator App
hi: ऑथेंटिकेटर ऐप का उपयोग करें
mr: ऑथेंटिकेटर अॅप वापरा
ta: அங்கீகரிப்பு செயலியைப் பயன்படுத்தவும்
te: ఆథెంటికేటర్ యాప్ ఉపయోగించండి

source: Use Face ID
hi: फेस आईडी का उपयोग करें
kn: Face ID ಬಳಸಿ
mr: फेस आयडी वापरा
ta: Face ID பயன்படுத்தவும்
te: Face ID ఉపయోగించండి

source: Use your password to continue.
hi: जारी रखने के लिए अपना पासवर्ड उपयोग करें।
kn: ಮುಂದುವರಿಸಲು ನಿಮ್ಮ ಪಾಸ್‌ವರ್ಡ್ ಬಳಸಿ.
mr: पुढे जाण्यासाठी तुमचा पासवर्ड वापरा.
ta: தொடர உங்கள் கடவுச்சொல்லைப் பயன்படுத்தவும்.
te: కొనసాగడానికి మీ పాస్‌వర్డ్‌ను ఉపయోగించండి.

source: Verification code
hi: सत्यापन कोड
kn: ಪರಿಶೀಲನಾ ಕೋಡ್
mr: सत्यापन कोड
ta: சரிபார்ப்பு குறியீடு
te: ధృవీకరణ కోడ్

source: Verification complete
hi: सत्यापन पूरा हुआ
kn: ಪರಿಶೀಲನೆ ಪೂರ್ಣಗೊಂಡಿದೆ
mr: पडताळणी पूर्ण
ta: சரிபார்ப்பு முடிந்தது
te: ధృవీకరణ పూర్తైంది

source: Verification Complete
hi: सत्यापन पूर्ण
kn: ಪರಿಶೀಲನೆ ಪೂರ್ಣಗೊಂಡಿದೆ
mr: सत्यापन पूर्ण
ta: சரிபார்ப்பு முடிந்தது
te: ధృవీకరణ పూర్తయింది

source: Verification Failed
hi: सत्यापन विफल
kn: ಪರಿಶೀಲನೆ ವಿಫಲವಾಗಿದೆ
mr: सत्यापन अयशस्वी
ta: சரிபார்ப்பு தோல்வியடைந்தது
te: ధృవీకరణ విఫలమైంది

source: Verification in progress
hi: सत्यापन प्रगति पर है
kn: ಪರಿಶೀಲನೆ ಪ್ರಗತಿಯಲ್ಲಿದೆ
mr: पडताळणी सुरू आहे
ta: சரிபார்ப்பு நடைபெறுகிறது
te: ధృవీకరణ కొనసాగుతోంది

source: Verified
hi: सत्यापित
kn: ಪರಿಶೀಲಿಸಲಾಗಿದೆ
mr: सत्यापित
ta: சரிபார்க்கப்பட்டது
te: ధృవీకరించబడింది

source: Verified Documents
hi: सत्यापित दस्तावेज़
kn: ಪರಿಶೀಲಿಸಿದ ದಾಖಲೆಗಳು

source: Verified on 12 Jan 2025
hi: 12 जन 2025 को सत्यापित
mr: 12 जाने 2025 रोजी पडताळले
ta: 12 ஜன 2025 அன்று சரிபார்க்கப்பட்டது
te: 12 జన 2025న ధృవీకరించబడింది

source: Verified on 14 Jan 2025
hi: 14 जन 2025 को सत्यापित
mr: 14 जाने 2025 रोजी पडताळले
ta: 14 ஜன 2025 அன்று சரிபார்க்கப்பட்டது
te: 14 జన 2025న ధృవీకరించబడింది

source: Verify email address
hi: ईमेल पता सत्यापित करें
kn: ಇಮೇಲ್ ವಿಳಾಸ ಪರಿಶೀಲಿಸಿ
mr: ईमेल पत्ता सत्यापित करा
ta: மின்னஞ்சல் முகவரியைச் சரிபார்க்கவும்
te: ఇమెయిల్ చిరునామాను ధృవీకరించండి

source: Verify Identity
hi: पहचान सत्यापित करें
kn: ಗುರುತನ್ನು ಪರಿಶೀಲಿಸಿ
mr: ओळख सत्यापित करा
ta: அடையாளத்தைச் சரிபார்க்கவும்
te: గుర్తింపును ధృవీకరించండి

source: Verify it's you
hi: पुष्टि करें कि यह आप हैं
kn: ಇದು ನೀವೇ ಎಂದು ಪರಿಶೀಲಿಸಿ
mr: ही तुम्हीच आहात याची खात्री करा
ta: இது நீங்கள்தான் என்பதை உறுதிப்படுத்துங்கள்
te: ఇది మీరేనని నిర్ధారించండి

source: Verify phone number
hi: फ़ोन नंबर सत्यापित करें
kn: ಫೋನ್ ಸಂಖ್ಯೆ ಪರಿಶೀಲಿಸಿ
mr: फोन नंबर सत्यापित करा
ta: தொலைபேசி எண்ணைச் சரிபார்க்கவும்
te: ఫోన్ నంబర్‌ను ధృవీకరించండి

source: Verifying your documents
hi: आपके दस्तावेज़ सत्यापित किए जा रहे हैं
kn: ನಿಮ್ಮ ದಾಖಲೆಗಳನ್ನು ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ
mr: तुमचे दस्तऐवज पडताळले जात आहेत
ta: உங்கள் ஆவணங்கள் சரிபார்க்கப்படுகின்றன
te: మీ పత్రాలు ధృవీకరించబడుతున్నాయి

source: Verifying…
hi: सत्यापित किया जा रहा है…
kn: ಪರಿಶೀಲಿಸಲಾಗುತ್ತಿದೆ…
mr: पडताळणी सुरू आहे…
ta: சரிபார்க்கப்படுகிறது…
te: ధృవీకరిస్తోంది…

source: View All
hi: सभी देखें
kn: ಎಲ್ಲವನ್ನೂ ನೋಡಿ
mr: सर्व पहा
ta: அனைத்தையும் காண்க
te: అన్నీ చూడండి

source: View your past and upcoming EMIs.
hi: अपनी पिछली और आगामी EMI देखें।
kn: ನಿಮ್ಮ ಹಳೆಯ ಮತ್ತು ಮುಂದಿನ EMIಗಳನ್ನು ನೋಡಿ.
mr: तुमच्या मागील आणि आगामी EMI पहा.
ta: உங்கள் கடந்த மற்றும் வரவிருக்கும் EMI-களை பாருங்கள்.
te: మీ గత మరియు రాబోయే EMIలను చూడండి.

source: We are currently evaluating your credit profile.
hi: हम वर्तमान में आपकी क्रेडिट प्रोफ़ाइल का मूल्यांकन कर रहे हैं।
kn: ನಾವು ಪ್ರಸ್ತುತ ನಿಮ್ಮ ಕ್ರೆಡಿಟ್ ಪ್ರೊಫೈಲ್ ಅನ್ನು ಮೌಲ್ಯಮಾಪನ ಮಾಡುತ್ತಿದ್ದೇವೆ.
mr: आम्ही सध्या तुमच्या क्रेडिट प्रोफाइलचे मूल्यांकन करत आहोत.
ta: நாங்கள் தற்போது உங்கள் கடன் சுயவிவரத்தை மதிப்பீடு செய்து வருகிறோம்.
te: మేము ప్రస్తుతం మీ క్రెడిట్ ప్రొఫైల్‌ను మూల్యాంకనం చేస్తున్నాము.

source: We couldn't verify the active user for this setting.
hi: हम इस सेटिंग के लिए सक्रिय उपयोगकर्ता की पुष्टि नहीं कर सके।
kn: ಈ ಸೆಟ್ಟಿಂಗ್‌ಗೆ ಸಕ್ರಿಯ ಬಳಕೆದಾರರನ್ನು ನಾವು ಪರಿಶೀಲಿಸಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ.
mr: या सेटिंगसाठी सक्रिय वापरकर्ता आम्ही पडताळू शकलो नाही.
ta: இந்த அமைப்பிற்கான செயலில் உள்ள பயனரை எங்களால் சரிபார்க்க முடியவில்லை.
te: ఈ సెట్టింగ్ కోసం క్రియాశీల వినియోగదారుని మేము ధృవీకరించలేకపోయాము.

source: We need a few documents to verify your identity and process your loan.
hi: आपकी पहचान सत्यापित करने और आपके ऋण को संसाधित करने के लिए हमें कुछ दस्तावेज़ चाहिए।
kn: ನಿಮ್ಮ ಗುರುತನ್ನು ಪರಿಶೀಲಿಸಲು ಮತ್ತು ನಿಮ್ಮ ಸಾಲವನ್ನು ಪ್ರಕ್ರಿಯೆಗೊಳಿಸಲು ನಮಗೆ ಕೆಲವು ದಾಖಲೆಗಳು ಬೇಕಾಗಿವೆ.
mr: तुमची ओळख पडताळण्यासाठी आणि कर्ज प्रक्रिया करण्यासाठी आम्हाला काही दस्तऐवज हवे आहेत.
ta: உங்கள் அடையாளத்தை சரிபார்த்து கடனை செயல்படுத்த சில ஆவணங்கள் தேவையாகின்றன.
te: మీ గుర్తింపును ధృవీకరించి రుణాన్ని ప్రాసెస్ చేయడానికి మాకు కొన్ని పత్రాలు అవసరం.

source: We’ll ask for
hi: हम मांगेंगे
mr: आम्ही मागू
ta: நாங்கள் கேட்போம்
te: మేము అడుగుతాము

source: We’ll ask the system to verify your identity now, then continue to authenticator setup.
hi: हम अभी सिस्टम से आपकी पहचान सत्यापित करने के लिए कहेंगे, फिर authenticator सेटअप जारी रहेगा।
mr: आम्ही आता सिस्टमला तुमची ओळख पडताळण्यास सांगू, त्यानंतर authenticator setup सुरू राहील.
ta: இப்போது உங்கள் அடையாளத்தை சரிபார்க்க அமைப்பிடம் கேட்டு, பின்னர் authenticator அமைப்பை தொடர்வோம்.
te: ఇప్పుడు మీ గుర్తింపును ధృవీకరించాలని సిస్టమ్‌ను అడిగి, తర్వాత authenticator సెటప్‌ను కొనసాగిస్తాము.

source: We’ll use this information to prefill your loan profile and match it with your documents.
hi: हम इस जानकारी का उपयोग आपके ऋण प्रोफ़ाइल को पहले से भरने और उसे आपके दस्तावेज़ों से मिलाने के लिए करेंगे।
mr: आम्ही ही माहिती तुमचे कर्ज प्रोफाइल आधीच भरण्यासाठी आणि ते तुमच्या दस्तऐवजांशी जुळवण्यासाठी वापरू.
ta: இந்த தகவலை உங்கள் கடன் சுயவிவரத்தை முன்பூர்த்தி செய்து, அதை உங்கள் ஆவணங்களுடன் பொருத்த பயன்படுத்துவோம்.
te: ఈ సమాచారాన్ని మీ రుణ ప్రొఫైల్‌ను ముందుగా నింపి, దాన్ని మీ పత్రాలతో సరిపోల్చడానికి ఉపయోగిస్తాము.

source: We’ll use this information to securely verify your identity.
hi: हम इस जानकारी का उपयोग आपकी पहचान को सुरक्षित रूप से सत्यापित करने के लिए करेंगे।
mr: आम्ही ही माहिती तुमची ओळख सुरक्षितपणे पडताळण्यासाठी वापरू.
ta: இந்த தகவலை உங்கள் அடையாளத்தை பாதுகாப்பாக சரிபார்க்க பயன்படுத்துவோம்.
te: ఈ సమాచారాన్ని మీ గుర్తింపును సురక్షితంగా ధృవీకరించడానికి ఉపయోగిస్తాము.

source: We're here to help with your loan and account.
hi: हम आपके ऋण और खाते में मदद करने के लिए यहाँ हैं।
kn: ನಿಮ್ಮ ಸಾಲ ಮತ್ತು ಖಾತೆಗೆ ಸಹಾಯ ಮಾಡಲು ನಾವು ಇಲ್ಲಿದ್ದೇವೆ.
mr: तुमच्या कर्ज आणि खात्यासाठी मदत करण्यासाठी आम्ही येथे आहोत.
ta: உங்கள் கடன் மற்றும் கணக்கிற்கு உதவ நாங்கள் இங்கே இருக்கிறோம்.
te: మీ రుణం మరియు ఖాతాకు సహాయం చేయడానికి మేము ఇక్కడ ఉన్నాము.

source: We've successfully received your loan application. Our team is currently reviewing your documents.
hi: हमें आपका ऋण आवेदन सफलतापूर्वक प्राप्त हुआ है। हमारी टीम वर्तमान में आपके दस्तावेज़ों की समीक्षा कर रही है।
kn: ನಿಮ್ಮ ಸಾಲ ಅರ್ಜಿಯನ್ನು ನಾವು ಯಶಸ್ವಿಯಾಗಿ ಸ್ವೀಕರಿಸಿದ್ದೇವೆ. ನಮ್ಮ ತಂಡವು ಪ್ರಸ್ತುತ ನಿಮ್ಮ ದಾಖಲೆಗಳನ್ನು ಪರಿಶೀಲಿಸುತ್ತಿದೆ.
mr: तुमचा कर्ज अर्ज आम्हाला यशस्वीरित्या प्राप्त झाला आहे. आमची टीम सध्या तुमचे दस्तऐवज पाहत आहे.
ta: உங்கள் கடன் விண்ணப்பத்தை வெற்றிகரமாக பெற்றுள்ளோம். எங்கள் குழு தற்போது உங்கள் ஆவணங்களை பரிசீலித்து வருகிறது.
te: మీ రుణ దరఖాస్తు మాకు విజయవంతంగా అందింది. మా బృందం ప్రస్తుతం మీ పత్రాలను సమీక్షిస్తోంది.

source: Welcome back
hi: वापसी पर स्वागत है
kn: ಮತ್ತೆ ಸ್ವಾಗತ
mr: परत स्वागत आहे
ta: மீண்டும் வரவேற்கிறோம்
te: మళ్లీ స్వాగతం

source: What happens next
hi: आगे क्या होगा
kn: ಮುಂದೆ ಏನಾಗುತ್ತದೆ
mr: पुढे काय होईल
ta: அடுத்து என்ன நடக்கும்
te: తర్వాత ఏమవుతుంది

source: What-If Simulator
hi: व्हाट-इफ सिम्युलेटर
kn: ಬದಲಾವಣೆ ಅನುಕರಕ
mr: काय झाल्यास सिम्युलेटर
ta: என்ன ஆகும் முன்மாதிரி
te: వాట్-ఇఫ్ సిమ్యులేటర్

source: Yes, the PAN card upload is confirmed. We will...
hi: हाँ, PAN कार्ड अपलोड की पुष्टि हो गई है। हम...
mr: हो, PAN कार्ड अपलोड पुष्टी झाले आहे. आम्ही...
ta: ஆம், PAN அட்டை பதிவேற்றம் உறுதிசெய்யப்பட்டது. நாங்கள்...
te: అవును, PAN కార్డ్ అప్‌లోడ్ నిర్ధారించబడింది. మేము...

source: Yesterday
hi: कल
kn: ನಿನ್ನೆ
mr: काल
ta: நேற்று
te: నిన్న

source: You are currently at 28%. Keeping this under 30% is excellent for maintaining a high score.
hi: आप वर्तमान में 28% पर हैं। इसे 30% से नीचे रखना उच्च स्कोर बनाए रखने के लिए बहुत अच्छा है।
mr: तुम्ही सध्या 28% वर आहात. हे 30% च्या खाली ठेवणे उच्च स्कोअर टिकवण्यासाठी उत्कृष्ट आहे.
ta: நீங்கள் தற்போது 28% இல் உள்ளீர்கள். இதை 30% க்குக் கீழே வைத்திருப்பது உயர்ந்த மதிப்பெண்ணை பராமரிக்க சிறந்தது.
te: మీరు ప్రస్తుతం 28% వద్ద ఉన్నారు. దీన్ని 30% కంటే తక్కువగా ఉంచడం మంచి స్కోరు నిలుపుకోవడానికి ఎంతో మంచిది.

source: You are in the top 20% of users!
hi: आप उपयोगकर्ताओं के शीर्ष 20% में हैं!
kn: ನೀವು ಉನ್ನತ 20% ಬಳಕೆದಾರರಲ್ಲಿ ಒಬ್ಬರು!
mr: तुम्ही वापरकर्त्यांच्या शीर्ष 20% मध्ये आहात!
ta: நீங்கள் முன்னணி 20% பயனர்களில் ஒருவர்!
te: మీరు అగ్ర 20% వినియోగదారుల్లో ఉన్నారు!

source: You can change this before submitting
hi: जमा करने से पहले आप इसे बदल सकते हैं
kn: ಸಲ್ಲಿಸುವ ಮೊದಲು ಇದನ್ನು ಬದಲಾಯಿಸಬಹುದು
mr: सादर करण्यापूर्वी तुम्ही हे बदलू शकता
ta: சமர்ப்பிக்கும் முன் இதை மாற்றலாம்
te: సమర్పించే ముందు దీన్ని మార్చవచ్చు

source: You can close this ticket if you have no further questions.
hi: यदि आपके और प्रश्न नहीं हैं तो आप यह टिकट बंद कर सकते हैं।
kn: ಇನ್ನಷ್ಟು ಪ್ರಶ್ನೆಗಳಿಲ್ಲದಿದ್ದರೆ ಈ ಟಿಕೆಟ್ ಮುಚ್ಚಬಹುದು.
mr: आणखी प्रश्न नसल्यास तुम्ही हे तिकीट बंद करू शकता.
ta: மேலும் கேள்விகள் இல்லையெனில் இந்த டிக்கெட்டை மூடலாம்.
te: మరిన్ని ప్రశ్నలు లేకపోతే ఈ టికెట్‌ను మూసివేయవచ్చు.

source: You have %lld unread messages.
hi: आपके पास %lld अपठित संदेश हैं।
mr: तुमच्याकडे %lld न वाचलेले संदेश आहेत.
ta: உங்களிடம் %lld படிக்காத செய்திகள் உள்ளன.
te: మీకు %lld చదవని సందేశాలు ఉన్నాయి.

source: You have 1 missed EMI. Avoid late fees.
hi: आपकी 1 EMI छूट गई है। विलंब शुल्क से बचें।
kn: ನೀವು 1 EMI ತಪ್ಪಿಸಿದ್ದೀರಿ. ವಿಳಂಬ ಶುಲ್ಕ ತಪ್ಪಿಸಿ.
mr: तुमची 1 EMI चुकली आहे. उशीर शुल्क टाळा.
ta: உங்களிடம் 1 தவறிய EMI உள்ளது. தாமதக் கட்டணத்தை தவிர்க்கவும்.
te: మీ 1 EMI మిస్ అయింది. ఆలస్య రుసుములు తప్పించుకోండి.

source: You have 3 recent hard inquiries. Avoid applying for new credit for the next 6 months to see a bump in your score.
hi: आपके पास 3 हाल की हार्ड इन्क्वायरी हैं। अपने स्कोर में सुधार देखने के लिए अगले 6 महीनों तक नए क्रेडिट के लिए आवेदन करने से बचें।
kn: ನಿಮಗೆ ಇತ್ತೀಚೆಗೆ 3 ಕಠಿಣ ಕ್ರೆಡಿಟ್ ವಿಚಾರಣೆಗಳಿವೆ. ನಿಮ್ಮ ಅಂಕದಲ್ಲಿ ಏರಿಕೆ ಕಾಣಲು ಮುಂದಿನ 6 ತಿಂಗಳು ಹೊಸ ಕ್ರೆಡಿಟ್‌ಗೆ ಅರ್ಜಿ ಸಲ್ಲಿಸುವುದನ್ನು ತಪ್ಪಿಸಿ.
mr: तुमच्याकडे 3 अलीकडील हार्ड चौकशा आहेत. तुमच्या स्कोअरमध्ये सुधारणा पाहण्यासाठी पुढील 6 महिने नवीन क्रेडिटसाठी अर्ज करणे टाळा.
ta: உங்களிடம் சமீபத்திய 3 ஹார்டு விசாரணைகள் உள்ளன. உங்கள் மதிப்பெண் உயர்வைக் காண அடுத்த 6 மாதங்களுக்கு புதிய கடனுக்கு விண்ணப்பிப்பதை தவிர்க்கவும்.
te: మీకు ఇటీవలి 3 హార్డ్ విచారణలు ఉన్నాయి. మీ స్కోరు మెరుగుపడేందుకు వచ్చే 6 నెలలు కొత్త క్రెడిట్ కోసం దరఖాస్తు చేయడం నివారించండి.

source: You have a missed payment for March 2026. Please clear your dues immediately to avoid further impact on your credit score.
hi: मार्च 2026 के लिए आपकी एक किस्त बकाया है। कृपया अपनी क्रेडिट रेटिंग पर और अधिक नकारात्मक प्रभाव पड़ने से बचने के लिए तुरंत अपनी बकाया राशि का भुगतान करें।

source: You should only see Apple’s native system prompt during passkey creation.
hi: पासकी बनाते समय आपको केवल Apple का मूल सिस्टम प्रॉम्प्ट ही दिखना चाहिए।
mr: passkey तयार करताना तुम्हाला फक्त Apple चे native system prompt दिसले पाहिजे.
ta: Passkey உருவாக்கும் போது Apple இன் சொந்த system prompt மட்டுமே தோன்ற வேண்டும்.
te: Passkey సృష్టించే సమయంలో మీకు Apple యొక్క స్థానిక system prompt మాత్రమే కనిపించాలి.

source: You will be guided through profile details, address proof, income details, e-signature, and identity verification.
hi: आपको प्रोफ़ाइल विवरण, पते का प्रमाण, आय विवरण, ई-हस्ताक्षर और पहचान सत्यापन के माध्यम से मार्गदर्शन दिया जाएगा।
mr: तुम्हाला प्रोफाइल तपशील, पत्त्याचा पुरावा, उत्पन्न तपशील, ई-स्वाक्षरी आणि ओळख पडताळणी यांमधून मार्गदर्शन केले जाईल.
ta: சுயவிவர விவரங்கள், முகவரி சான்று, வருமான விவரங்கள், மின் கையொப்பம் மற்றும் அடையாள சரிபார்ப்பு ஆகியவற்றில் உங்களுக்கு வழிகாட்டப்படும்.
te: ప్రొఫైల్ వివరాలు, చిరునామా రుజువు, ఆదాయ వివరాలు, ఈ-సంతకం మరియు గుర్తింపు ధృవీకరణ దశల ద్వారా మీకు మార్గనిర్దేశం చేయబడుతుంది.

source: You will be redirected to your bank's secure portal to authorize this mandate. No amount will be deducted today.
hi: इस मैंडेट को अधिकृत करने के लिए आपको अपने बैंक के सुरक्षित पोर्टल पर भेजा जाएगा। आज कोई राशि नहीं काटी जाएगी।
mr: हा मँडेट अधिकृत करण्यासाठी तुम्हाला तुमच्या बँकेच्या सुरक्षित पोर्टलवर वळवले जाईल. आज कोणतीही रक्कम वजा केली जाणार नाही.
ta: இந்த ஆணையை அங்கீகரிக்க உங்கள் வங்கியின் பாதுகாப்பான தளத்திற்கு மாற்றப்படுவீர்கள். இன்று எந்தத் தொகையும் பிடிக்கப்படாது.
te: ఈ మాండేట్‌కు అనుమతి ఇవ్వడానికి మిమ్మల్ని మీ బ్యాంక్ యొక్క సురక్షిత పోర్టల్‌కు మళ్లిస్తారు. ఈ రోజు ఎటువంటి మొత్తం డెబిట్ చేయబడదు.

source: You're Eligible!
hi: आप पात्र हैं!
mr: तुम्ही पात्र आहात!
ta: நீங்கள் தகுதியானவர்!
te: మీరు అర్హులు!

source: You're making great financial decisions.
hi: आप शानदार वित्तीय निर्णय ले रहे हैं।
mr: तुम्ही उत्तम आर्थिक निर्णय घेत आहात.
ta: நீங்கள் சிறந்த நிதி முடிவுகளை எடுக்கிறீர்கள்.
te: మీరు అద్భుతమైన ఆర్థిక నిర్ణయాలు తీసుకుంటున్నారు.

source: Your application and documents have been received.
hi: आपका आवेदन और दस्तावेज़ प्राप्त हो गए हैं।
kn: ನಿಮ್ಮ ಅರ್ಜಿ ಮತ್ತು ದಾಖಲೆಗಳನ್ನು ಸ್ವೀಕರಿಸಲಾಗಿದೆ.
mr: तुमचा अर्ज आणि दस्तऐवज प्राप्त झाले आहेत.
ta: உங்கள் விண்ணப்பமும் ஆவணங்களும் பெறப்பட்டுள்ளன.
te: మీ దరఖాస్తు మరియు పత్రాలు స్వీకరించబడ్డాయి.

source: Your Details
hi: आपकी जानकारी
kn: ನಿಮ್ಮ ವಿವರಗಳು
mr: तुमची माहिती
ta: உங்கள் விவரங்கள்
te: మీ వివరాలు

source: Your documents are encrypted and used only for verification.
hi: आपके दस्तावेज़ एन्क्रिप्टेड हैं और केवल सत्यापन के लिए उपयोग किए जाते हैं।
kn: ನಿಮ್ಮ ದಾಖಲೆಗಳು ಎನ್ಕ್ರಿಪ್ಟ್ ಮಾಡಲ್ಪಟ್ಟಿದ್ದು ಪರಿಶೀಲನೆಗಾಗಿ ಮಾತ್ರ ಬಳಸಲಾಗುತ್ತದೆ.
mr: तुमचे दस्तऐवज एन्क्रिप्ट केलेले आहेत आणि फक्त पडताळणीसाठी वापरले जातात.
ta: உங்கள் ஆவணங்கள் குறியாக்கம் செய்யப்பட்டவை மற்றும் சரிபார்ப்பிற்காக மட்டுமே பயன்படுத்தப்படுகின்றன.
te: మీ పత్రాలు ఎన్‌క్రిప్ట్ చేయబడి ధృవీకరణ కోసం మాత్రమే ఉపయోగించబడతాయి.

source: Your documents are securely encrypted
hi: आपके दस्तावेज़ सुरक्षित रूप से एन्क्रिप्टेड हैं
kn: ನಿಮ್ಮ ದಾಖಲೆಗಳು ಸುರಕ್ಷಿತವಾಗಿ ಎನ್ಕ್ರಿಪ್ಟ್ ಆಗಿವೆ
mr: तुमचे दस्तऐवज सुरक्षितपणे एन्क्रिप्ट केलेले आहेत
ta: உங்கள் ஆவணங்கள் பாதுகாப்பாக குறியாக்கம் செய்யப்பட்டுள்ளன
te: మీ పత్రాలు భద్రంగా ఎన్‌క్రిప్ట్ చేయబడ్డాయి

source: Your EMI has been successfully received.
hi: आपकी EMI सफलतापूर्वक प्राप्त हो गई है।
kn: ನಿಮ್ಮ EMI ಯಶಸ್ವಿಯಾಗಿ ಸ್ವೀಕರಿಸಲಾಗಿದೆ.
mr: तुमची EMI यशस्वीरित्या प्राप्त झाली आहे.
ta: உங்கள் EMI வெற்றிகரமாக பெறப்பட்டது.
te: మీ EMI విజయవంతంగా అందుకుంది.

source: Your EMI payment has been processed and your loan account will be updated shortly.
hi: आपका EMI भुगतान संसाधित हो गया है और आपका ऋण खाता शीघ्र ही अपडेट होगा।
kn: ನಿಮ್ಮ EMI ಪಾವತಿ ಪ್ರಕ್ರಿಯೆಗೊಳಿಸಲಾಗಿದೆ ಮತ್ತು ನಿಮ್ಮ ಸಾಲ ಖಾತೆ ಶೀಘ್ರದಲ್ಲೇ ನವೀಕರಿಸಲಾಗುತ್ತದೆ.
mr: तुमचे EMI पेमेंट प्रक्रिया झाले आहे आणि तुमचे कर्ज खाते लवकरच अद्यतनित होईल.
ta: உங்கள் EMI கட்டணம் செயல்படுத்தப்பட்டுள்ளது; உங்கள் கடன் கணக்கு விரைவில் புதுப்பிக்கப்படும்.
te: మీ EMI చెల్లింపు ప్రాసెస్ చేయబడింది మరియు మీ రుణ ఖాతా త్వరలో నవీకరించబడుతుంది.

source: Your Good score (724) earns you these perks.
hi: आपके अच्छे स्कोर (724) से आपको ये लाभ मिलते हैं।
mr: तुमच्या चांगल्या स्कोअरमुळे (724) तुम्हाला हे फायदे मिळतात.
ta: உங்கள் நல்ல மதிப்பெண் (724) இந்த நன்மைகளை வழங்குகிறது.
te: మీ మంచి స్కోర్ (724) మీకు ఈ ప్రయోజనాలను ఇస్తుంది.

source: Your identity has been fully verified. You are eligible for instant loan disbursals.
hi: आपकी पहचान पूरी तरह से सत्यापित हो गई है। आप तत्काल ऋण संवितरण के लिए पात्र हैं।
kn: ನಿಮ್ಮ ಗುರುತನ್ನು ಸಂಪೂರ್ಣವಾಗಿ ಪರಿಶೀಲಿಸಲಾಗಿದೆ. ನೀವು ತಕ್ಷಣದ ಸಾಲ ವಿತರಣೆಗೆ ಅರ್ಹರು.

source: Your identity has been successfully verified.
hi: आपकी पहचान सफलतापूर्वक सत्यापित हो गई है।
kn: ನಿಮ್ಮ ಗುರುತನ್ನು ಯಶಸ್ವಿಯಾಗಿ ಪರಿಶೀಲಿಸಲಾಗಿದೆ.
mr: तुमची ओळख यशस्वीरित्या पडताळली गेली आहे.
ta: உங்கள் அடையாளம் வெற்றிகரமாக சரிபார்க்கப்பட்டது.
te: మీ గుర్తింపు విజయవంతంగా ధృవీకరించబడింది.

source: Your loans, sorted.
hi: आपके ऋण, व्यवस्थित।
kn: ನಿಮ್ಮ ಸಾಲಗಳು, ಸರಿಯಾಗಿ ಸಜ್ಜುಗೊಂಡಿವೆ.
mr: तुमची कर्जे, व्यवस्थित.
ta: உங்கள் கடன்கள், ஒழுங்காக.
te: మీ రుణాలు, క్రమబద్ధంగా.

source: Your mandate has been successfully registered. Your EMIs will now be deducted automatically.
hi: आपका मैंडेट सफलतापूर्वक पंजीकृत हो गया है। आपकी EMI अब स्वचालित रूप से काट ली जाएगी।
